<script lang="ts">
import {defineComponent} from 'vue'

export default defineComponent({
  name: "Guide"
})
</script>

<template>
  <container>
    <Row style="padding: 3rem 0">
      <Col >
        <h1>Необходимый перечень документов
          для вида на жительство</h1>
      </Col>
    </Row>
    <Row>
      <Col >
        <Divider title="***"/>
      </Col>
    </Row>
    <Row style="padding: 1rem 0">
      <Col>
        <p>1. Заявление-анкета, 2 экземпляра</p>
        <Accordion parent>
          <AccordionItem>
            <AccordionHeader level="2">
              <AccordionButton>Инструкция по заполнению</AccordionButton>
            </AccordionHeader>
            <AccordionCollapse>
              <AccordionBody>
                <a
                    href="https://docs.google.com/document/d/1zUC7W2sZ0MAjkKmKSO2gmGtlLhz8bgAo/edit?usp=sharing&ouid=110242670136602449334&rtpof=true&sd=true">
                  <b-button button="primary" style="margin: 1rem 0">
                  Открыть шаблон
                  </b-button>
                </a>
                <br />
                <ul>
                  <li>Внимательно прочтите заявление</li>
                  <li>Скопируйте заявление себе на пк или Google Disk</li>
                  <li>Заполните все подчеркнутые поля, при заполнении следите что бы вводимый вами текст был выделен <strong>жирным</strong></li>
                  <li>При заполнении таблиц, обратите внимание, что у вас не должно остаться пустых строк, при необходимости добавьте или удалите строки</li>
                  <li>Все даты и адреса должны быть полными, даты - с указанием дня, месяца, года, адреса - с указанием страны, города, улицы и т.д.</li>
                  <li>Поля начиная с даты подачи заполняются позже при подаче заявления, оставьте их пустыми</li>
                </ul>
                <img src="/static/1.png" />
                <img src="/static/2.png" />
              </AccordionBody>
            </AccordionCollapse>
          </AccordionItem>
        </Accordion>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">2. Копии паспортов загран, или документа лица без гражданства с переводом. Подлинность подписи переводчика нотариально удостоверяется. Документы,
          составленные на иностранном языке, <strong>подлежат</strong> переводу на государственный либо на русский язык.</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">3. Cправка из банка Республики Казахстан о подтверждении платежеспособность в тенге (оригинал + копия не заверенная)
          <ul><li>на личном счету должна быть сумма не менее 1 320 МРП, в 2024 году - <strong>4 873 440 тенге</strong></li></ul>
          <strong>Исключение:</strong> этнические казахи со статусом «кандас»; лица, родившиеся или ранее состоявшие в гражданстве Республики Казахстан или Казахской CCP.
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">4. Копия миграционной карты и листка регистрации, временная регистрация-частная виза, уведомлении о прибытии</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">5. Справка (письмо посольства) об отсутствии судимости на Родине <strong>с апостилем</strong>.
          <br /><strong>Важно:</strong> если была изменена фамилия, необходимо предоставить справку в том числе на девичью фамилию.</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">6. Медицинская справка Формы - 28У</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">7. Состоящие в браке с гражданами Республики Казахстан, постоянно проживающими на территории Республики Казахстан, представляют копии свидетельства о браке и документ, удостоверяющий личность cyпpyra (супурги).</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">8. Нотариально заверенный договор с физическим или юридические лицом о предоставлении заявителю жилища либо нотариально заверенное согласие на проживание и постановку на постоянный регистрационный учет иностранца либо лица без гражданство на срок не менее 180 календарный дней.
          <br /><strong>А так же:</strong>
          <ul>
            <li>Копия удостоверения личности владельца жилья</li>
            <li>Справка о зарегистрированных правах (обременениях) на недвижимое имущество. (<strong>владелец</strong> имущества может скачать справку онлайн в личном кабинете egov, или заказать у нотариуса)</li>
          </ul>
        </p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">9. Фотографии 3.5 х 4.5 см - 3 шт.</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">10. Скоросшиватель, почтовый конверт.</p>
      </Col>
    </Row>
    <Row>
      <Col>
        <p style="padding: 1rem 0">11. Квитанция об оплате гос пошлины (можно оплатить в банке)<br />
          Размер пошлины 4 МРП, в 2024 году - <strong>14 768 тенге.</strong> <br />
          Реквизиты для оплаты пошлины по Ауэзовскому району <br />
          <strong>КБК 108126 <br />
          КНП 911 <br />
            НУ по Ауэзовскому району</strong></p>
      </Col>
    </Row>
    <Row style="padding: 1rem 0">
      <Col>
        <p>Сроки действия справок: о несудимости, согласия Посольства, подтверждение платежеспособности, согласие на прописку - не более 180 календарных дней (6 месяцев)</p>
        <p>Срок действия паспорта на день подачи заявления должен быть свыше 180 календарных дней (6 месяцев)</p>
        <p>Документы, составленные на иностранном языке, <strong>подлежат переводу</strong> на государственный, либо на русский язык (<strong>нотариально заверены</strong>)</p>
      </Col>
    </Row>
    <Row style="padding: 1rem 0">
      <Col >
        <Divider title="***"/>
      </Col>
    </Row>
  </container>

</template>

<style scoped>
  img {
    max-width: 80vw !important;
  }
</style>